goodies.org
** if-set
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro if-set (vars &rest body)
  (let ((if-true (gensym "it")) (result (gensym "r")))
    `(let (,if-true ,result)
       (setf ,result (when-set ,vars
		  (setf ,if-true t)
		  ,(car body)))
       (if ,if-true ,result
	 ,@(cdr body)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
  '(if-set ((x 1) (y (1+ x)))
     (+ x y) (- x y) (* x y))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let (it28 r29) 
(setf r29 (when-set ((x 1) (y (1+ x))) (setf it28 t) (+ x y)))
 (if it28 r29 (- x y) (* x y)))
:END:

** cond-let
=cond-let= is a natural generalization of =if-let=:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro cond-let (&rest conds)
  "cond with let"
  (let ((c (car conds)) (r (cdr conds)))
    (if (equal (car c) 'otherwise) (cons 'progn (cdr c))
    (if r
	`(if-let ,(car c) ,(cons 'progn (cdr c)) ,(macroexpand-1 `(cond-let ,@r)))
	`(when-let ,(car c) ,@(cdr c))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1
  '(cond-let
    (((x 1) (y (1+ x))) (+ x y) (- x y) (* x y))
    (((x 3) (y (1+ x))) (+ x y) (- x y) (/ x y))
    (otherwise 22 33))))
#+END_SRC

#+RESULTS:
:RESULTS:
(if-let ((x 1) (y (1+ x))) (progn (+ x y) (- x y) (* x y)) (if-let ((x 3) (y (1+ x))) (progn (+ x y) (- x y) (/ x y)) (progn 22 33)))
:END:

Formatted result:
#+BEGIN_SRC emacs-lisp
(if-let ((x 1) (y (1+ x)))
  (progn (+ x y) (- x y) (* x y))
  (if-let ((x 3) (y (1+ x))) 
    (progn (+ x y) (- x y) (/ x y))
    (progn 22 33)))
#+END_SRC

** needs
New =needs= macro is gradually replacing =when-let=:

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro needs (vardefs &rest body)
  "unifying when-let and if-let"
  (let ((vardef (car vardefs)))
    (if (and (listp vardef) (not (or (special-form-p (car vardef)) (functionp (car vardef)) (macrop (car vardef)))))
    `(let ((,(car vardef) ,(cadr vardef)))
       ,(if (cddr vardef)
	    `(if ,(car vardef)
		,(if (cdr vardefs)
		     (macroexpand-1 `(needs ,(cdr vardefs) ,@body))
		   `(progn ,@body))
	       ,(car (cddr vardef)))
	  (append `(when ,(car vardef))
		  (if (cdr vardefs)
		      (list (macroexpand-1 `(needs ,(cdr vardefs) ,@body)))
		    body))))
    (append `(when ,vardef)
		  (if (cdr vardefs)
		      (list (macroexpand-1 `(needs ,(cdr vardefs) ,@body)))
		    body)))))
#+END_SRC
=needs= acts similarly to =when-let= except that for every variable decalared in its header
it has an optional third argument – a form to be evaluated in case the variable turns out to be ~nil~.

#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(needs
((x (f 1) (message "could not define x"))
 (y (g x) (message "could not define y")))
(message "let's rock")
(- x y))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let ((x (f 1))) (if x (let ((y (g x))) (if y (progn (message let's rock) (- x y)) (message could not define y))) (message could not define x)))
:END:

← let me format the output:
#+BEGIN_SRC emacs-lisp
(let ((x (f 1)))
  (if x
      (let ((y (g x)))
	(if y
	    (progn
	      (message "let's rock")
	      (- x y))
	  (message "could not define y")))
    (message could "not define x")))
#+END_SRC


For other usage examples, see [[https://github.com/chalaev/cloud][cloud]] project, e.g.:
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(needs ((col-value (begins-with str (car column)) (bad-column "action" (cdr column))))
(aset action (cdr column) (car col-value))
(setf str (cdr col-value)))))
#+END_SRC

Sometimes I need a slightly changed version of =needs= that does not create a local variable,
setting the value of a global one instead:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro first2(ll) `(firstN ,ll 2))
(defmacro needs-set (vardefs &rest body)
  "needs with 'let' being replaced with 'setf'"
  (let ((vardef (car vardefs)))
    (if (cddr vardef)
      `(if-set (,(first2 vardef))
	  ,(if (cdr vardefs)
	       (macroexpand-1 `(needs-set ,(cdr vardefs) ,@body))
	     (cons 'progn body))
	  ,(caddr vardef))
      `(when-set (,(car vardefs))
	   ,(if (cdr vardefs)
	       (macroexpand-1 `(needs-set ,(cdr vardefs) ,@body))
	      (cons 'progn body))))))
#+END_SRC

Example #1:
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(needs-set
((x (f 1) (message "did not set x"))
 (y (g x) (message "did not set y")))
(message "let's rock")
(- x y))))
#+END_SRC

#+RESULTS:
:RESULTS:
(if-set ((x (f 1))) (if-set ((y (g x))) (progn (message let's rock) (- x y)) (message did not set y)) (message did not set x))
:END:

and here is the formatted result:
#+BEGIN_SRC emacs-lisp
(if-set ((x (f 1)))
  (if-set ((y (g x)))
     (progn
       (message let's rock)
       (- x y))
     (message "did not set y"))
  (message "did not set x"))
#+END_SRC

Example #2 (from the [[https://github.com/chalaev/cloud][cloud project]]):
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(needs-set
  ((conf (read-conf* (local/config)))
   (remote/files (cdr (assoc "remote/files" conf)) (clog :error "specify 3-symbol contents name (remote/files) in %s" (local/config)))
   (N-CPU-cores (string-to-number
 (or
 (cdr (assoc "number-of-CPU-cores" conf))
 (clog :warning "specify number-of-CPU-cores in %s" (local/config)
 "1"))))
   (password (cdr (assoc "password" conf)) (clog :error "specify password in %s" (local/config)))
   (remote-dir (cdr (assoc "remote-directory" conf)) (clog :error "specify remote-directory in %s" (local/config))))
conf)))
#+END_SRC

#+RESULTS:
:RESULTS:
(when-set ((conf (read-conf* (local/config)))) (if-set ((remote/files (cdr (assoc remote/files conf)))) (when-set ((N-CPU-cores (string-to-number (or (cdr (assoc number-of-CPU-cores conf)) (clog :warning specify number-of-CPU-cores in %s (local/config) 1))))) (if-set ((password (cdr (assoc password conf)))) (if-set ((remote-dir (cdr (assoc remote-directory conf)))) (progn conf) (clog :error specify remote-directory in %s (local/config))) (clog :error specify password in %s (local/config)))) (clog :error specify 3-symbol contents name (remote/files) in %s (local/config))))
:END:
and here is the formatted result:
#+BEGIN_SRC emacs-lisp
(when-set ((conf (read-conf* (local/config))))
  (if-set ((remote/files (cdr (assoc remote/files conf))))
    (when-set ((N-CPU-cores (string-to-number (or (cdr (assoc number-of-CPU-cores conf)) (clog :warning specify number-of-CPU-cores in %s (local/config) 1)))))
      (if-set ((password (cdr (assoc password conf))))
        (if-set ((remote-dir (cdr (assoc remote-directory conf))))
	  (progn conf)
	  (clog :error specify remote-directory in %s (local/config)))
	(clog :error specify password in %s (local/config))))
    (clog :error specify 3-symbol contents name (remote/files) in %s (local/config))))
#+END_SRC

** email
A non-interactive =email= function:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
(defun email (addr &optional subject body)
  "fast non-interactive way to send an email"
  (compose-mail addr (if subject subject ""))
  (when body (insert body))
  (message-send-and-exit))
#+END_SRC
– will work if mailing system (~exim4~ in my case) is configured properly.

** pos
Position of an element in a list:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun pos (el ll)
  (let ((i 0) r)
  (dolist (e ll r)
    (if (eql e el)
	(setf r i)
      (incf i)))))
#+END_SRC

** remo & drop
Remo is a helper for =drop= macro which removes elements from an array:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun remo (from-where &rest what)
  (if (cdr what)
      (remo
       (apply #'remo (cons from-where (cdr what)))
       (car what))
 (remove (car what) from-where)))
(defmacro drop (from-where &rest what)
  `(setf ,from-where (remo ,from-where ,@what)))
#+END_SRC
Test:
#+BEGIN_SRC emacs-lisp :results drawer
(let ((ll '(1 2 3 4 5 6)))
  (drop ll 2 4)
  ll)
#+END_SRC

#+RESULTS:
:RESULTS:
(1 3 5 6)
:END:

** perms-from-str
When I ask ~emacs~ to show me file's permissions, it provides a text string (e.g., "-rw-rw----") instead of a number.
The following function produces a number from such a string:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun perms-from-str (str)
"parses file mode string into integer"
  (let ((text-mode (reverse (cdr (append str nil)))) (mode 0) (fac 1))
    (loop for c in text-mode for i from 0
          unless (= c ?-) do (incf mode fac)
          do (setf fac (* 2 fac)))
    mode))
#+END_SRC
Usage example:
#+BEGIN_SRC emacs-lisp :results drawer
(perms-from-str "-rw-rw----")
#+END_SRC

#+RESULTS:
:RESULTS:
432
:END:

** perms-to-str
=perms-to-str= is just the opposite of [[perms-from-str]].
#+BEGIN_SRC emacs-lisp :results drawer
(let ((ll '((1 . 0))))
  (dotimes (i 8 ll)
     (push (cons (* 2 (caar ll)) (mod (1+ i) 3))  ll)))
#+END_SRC

#+RESULTS:
:RESULTS:
((256 . 2) (128 . 1) (64 . 0) (32 . 2) (16 . 1) (8 . 0) (4 . 2) (2 . 1) (1 . 0))
:END:

#+BEGIN_SRC emacs-lisp :results drawer
(let ((ll '((1 . 0))))
  (dotimes (i 8 ll)
     (push (cons (* 2 (caar ll)) (mod (1+ i) 3))  ll)))
#+END_SRC

#+RESULTS:
:RESULTS:
((256 . 2) (128 . 1) (64 . 0) (32 . 2) (16 . 1) (8 . 0) (4 . 2) (2 . 1) (1 . 0))
:END:

#+BEGIN_SRC emacs-lisp :results drawer
(let ((ll '((1 . 0))) (file-mode #o664))
  (apply #'concat (mapcar
		   #'(lambda(x) (format "%c" (if (= 0 (logand file-mode (car x))) ?- (aref "xwr" (cdr x)))))
  (dotimes (i 8 ll)
     (push (cons (* 2 (caar ll)) (mod (1+ i) 3))  ll)))))
#+END_SRC

#+RESULTS:
:RESULTS:
rw-rw-r--
:END:
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun perms-to-str(file-mode)
"formats integer file mode into string"
(let ((ll '((1 . 0))))
  (apply #'concat (mapcar
		   #'(lambda(x) (format "%c" (if (= 0 (logand file-mode (car x))) ?- (aref "xwr" (cdr x)))))
  (dotimes (i 8 ll)
     (push (cons (* 2 (caar ll)) (mod (1+ i) 3))  ll))))))
#+END_SRC
Usage example:
#+BEGIN_SRC emacs-lisp :results drawer
(perms-to-str #o667)
#+END_SRC

#+RESULTS:
:RESULTS:
rw-rw-rwx
:END:

** parsing time and date
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-date (str)
  (mapcar 'string-to-number
	  (cond
 ((string-match "\\([0-9]\\{4\\}\\)[/-]\\([0-9][0-9]\\)[/-]\\([0-9][0-9]\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(3 2 1)))
 ((string-match "\\([0-9][0-9]\\)[/-]\\([0-9][0-9]\\)[/-]\\([0-9]\\{4\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(2 1 3)))
 ((string-match "\\([0-9][0-9]\\)\\.\\([0-9][0-9]\\)\\.\\([0-9]\\{4\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(1 2 3)))
 ((string-match "\\([0-9][0-9]\\)/\\([0-9][0-9]\\)/\\([0-9]\\{2\\}\\)" str) (mapcar #'(lambda (x) (match-string x str)) '(2 1 3)))
 ((string-match "\\([0-9]\\{2\\}\\)[/-]\\([0-9][0-9]\\)" str) (append (mapcar #'(lambda (x) (match-string x str)) '(2 1)) (list (format-time-string "%Y" (current-time)))))
 (t (clog :error "date format not recognized in %s" str) nil))))
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-only-time (str)
  (firstN (parse-time-string str) 3))
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun parse-date-time(str)
  (if (string-match "[0-9]\\{4\\}-[0-9][0-9]-[0-9][0-9] [0-9][0-9]:[0-9][0-9]" str)
      (parse-time-string str)
    (let ((SS (split-string str)))
      (append (parse-only-time (cadr SS))
	      (parse-date (car SS))))))
#+END_SRC
Example:
#+BEGIN_SRC emacs-lisp :results drawer
(cons (parse-only-time "16:09:37")
(mapcar #'(lambda(x) (format-time-string "%F %H:%M:%S %Z" (apply #'encode-time (parse-date-time x))))
 (list "10/21 14:54"
        "2020-10-10 14:54:40  EDT")))
#+END_SRC

#+RESULTS:
:RESULTS:
((37 9 16) 2020-10-21 14:54:00 EDT 2020-10-10 14:54:40 EDT)
:END:

