goodies.org
** directory-lock
=directory-lock= attempts to create directory =locked-dir=.

If the subdirectory was sucessfully created,
1. file "by" is created there containing the string ~by~, and
2. forms ~body~ are evaluated.

=directory-lock= returns =cons=; its =car= is ~t~ in case
all =directory-lock= operations went through successfully:
the directory was successfully locked and later unlocked;
in this case, =cdr= contains the result of ~body~ evaluation.

#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro directory-lock(locked-dir by &rest body)
(let ((LD0 (gensym "ld0-")) (LD1 (gensym "ld1-")) (lock-file (gensym "lf")) (mkdir (gensym "md")) (result (gensym "r")) (unlock (gensym "u")))
#+END_SRC
Adding slash symbol at the end of =locked-dir= if necessary:
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
`(let* ((,LD0 ,locked-dir)
        (,LD1 (if (= ?/ (aref (reverse ,LD0) 0)) ,LD0 (concat ,LD0 "/")))
        (,lock-file (concat ,LD1 "by"))
        (,mkdir (safe-mkdir ,LD1)))
  (ifn (car ,mkdir) (cons nil ,mkdir)
  (write-region ,by nil ,lock-file)
  (let ((,result (progn ,@body)))
    (if-let ((,unlock (and (safe-delete-file ,lock-file) (safe-delete-dir ,LD1))))
      (cons t ,result)
      (cons nil (cons ,unlock ,result))))))))
#+END_SRC

If something went wrong, =(car (directory-lock ...))= is =nil=,
and the problem is described by =(cadr (directory-lock ...))= which is
- ~:lock~ in case the directory could not be locked, or
- ~:unlock~ in case the directory could not be unlocked. That is, we were able to create the directory ~locked-dir~,
  then evaluated the ~body~ forms, but finally could not erase ~locked-dir~.

Example – locking remote directory: 
#+BEGIN_SRC emacs-lisp :results drawer
(print (macroexpand-1 '(directory-lock "/mnt/server/code-name" (system-name)
(body-1) (body-2))))
#+END_SRC

#+RESULTS:
:RESULTS:
(let* ((ld0-58 /mnt/server/code-name) (ld1-59 (if (= 47 (aref (reverse ld0-58) 0)) ld0-58 (concat ld0-58 /))) (lf60 (concat ld1-59 by)) (md61 (safe-mkdir ld1-59))) (ifn (car md61) (cons nil md61) (write-region (system-name) nil lf60) (let ((r62 (progn (body-1) (body-2)))) (if-let ((u63 (and (safe-delete-file lf60) (safe-delete-dir ld1-59)))) (cons t result) (cons nil (cons u63 r62))))))
:END:

Formatted result:
#+BEGIN_SRC
(let* ((ld0-58 "/mnt/server/code-name")
       (ld1-59 (if (= 47 (aref (reverse ld0-58) 0)) ld0-58 (concat ld0-58 "/")))
       (lf60 (concat ld1-59 "by"))
       (md61 (safe-mkdir ld1-59)))
  (ifn (car md61) (cons nil md61)
    (write-region (system-name) nil lf60)
    (let ((r62 (progn (body-1) (body-2))))
      (if-let ((u63 (and (safe-delete-file lf60) (safe-delete-dir ld1-59))))
	  (cons t r62)
	(cons nil (cons u63 r62))))))
#+END_SRC

** simple stuff
#+BEGIN_SRC emacs-lisp :tangle generated/macros.el
(defmacro ifn (test ifnot &rest ifyes)
`(if (not ,test) ,ifnot ,@ifyes))
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle generated/functions.el
(defun firstN(lista N)
  "returning first N elments of the list"
  (when (and (< 0 N) (car lista))
    (cons (car lista) (firstN (cdr lista) (1- N)))))
#+END_SRC

*** safe-mkdir
=safe-mkdir= is a condition-free wrapper on top of =make-directory=.

Its argument ~dirname~ 
- may start with "~/" and
- may or may not and with "/".

It returns =cons=; its =car= is
- ~nil~ in case the directory can not be created (then =cdr= explains why), or
- ~t~ in case the directory was sucessfully created.

#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun safe-mkdir (dirname)
  (if (file-exists-p dirname)
    (cons nil (if (file-directory-p dirname) :exists :file))
    (condition-case err
        (progn (make-directory dirname) (list t))
      (file-already-exists (cons nil :strange))
      (file-error (cons nil :permission)))))
#+END_SRC
Returns ~(t)~ when succeeds.

*** safe-delete-file
=safe-delete-file= is a condition-free wrapper on top of =delete-file=.
Its return result is similar to that of =safe-mkdir=
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun safe-delete-file (FN)
  (condition-case err (progn (delete-file FN) (list t))
    (file-error (cons nil (error-message-string err)))))
#+END_SRC
except that removal of nonexistent file does not lead to an error.

Example #1 – removing file with insufficient permissions produces "permission denied" error:
#+BEGIN_SRC emacs-lisp :results drawer
(safe-delete-file  "/bin/ls")
#+END_SRC

#+RESULTS:
:RESULTS:
(nil . Removing old name: Permission denied, /bin/ls)
:END:

Example #2 – removing nonexistent file produces no error:
#+BEGIN_SRC emacs-lisp :results drawer
(safe-delete-file  "/bin/there-is-no-such-file")
#+END_SRC

#+RESULTS:
:RESULTS:
(t)
:END:

Example #3 – an attempt to remove a directory produces an error:
#+BEGIN_SRC emacs-lisp :results drawer
(safe-delete-file  "/tmp")
#+END_SRC

#+RESULTS:
:RESULTS:
(nil . Removing old name: is a directory: /tmp)
:END:

To (non-recursively) remove a directory, one can use =safe-delete-dir= instead:

*** safe-delete-dir
Non-recursive directory removal.

Its return result is similar to that of =safe-delete-file= and =safe-mkdir=:
#+BEGIN_SRC emacs-lisp :tangle generated/file-functions.el
(defun safe-delete-dir (FN)
  (condition-case err (progn (delete-directory FN) (list t))
    (file-error (cons nil (error-message-string err)))))
#+END_SRC

* logging system
It is probably too small to be packaged.
** Short description
This code prints log messages to ~*Messages*~ buffer and saves them to log file =~/.emacs.d/elisp.log=.
Every message is formatted similarly to how it is done by =format= function.
** Code
Global variable =*log-level*= controls how much information should be logged: the (default) zero value means
that all types of log-messages (:debug :warning :info :error) should be logged (saved);
the value 3 means that only error messages (marked with :error) will be logged:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el :shebang ";; -*- mode: Emacs-Lisp;  lexical-binding: t; -*-"
;; generated from https://notabug.org/shalaev/elisp-goodies/src/master/goodies.org
(unless (boundp '*log-level*) (defvar *log-level* 0))
(unless (boundp '*emacs-d*) (defvar *emacs-d* (concat (getenv "HOME") "/.emacs.d/")))
#+END_SRC
Log messages are accumulated in =*file-acc-buffer*=
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(unless (boundp '*file-acc-buffer*) (defvar *file-acc-buffer* nil))
(defvar *last-FLD* nil "saves last day printed to the log file")
#+END_SRC
and once in a while (when the number of queued messages >30 or before quitting ~emacs~) appended to the file =~/.emacs.d/elisp.log=:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun clog-flush()
  "save log messages to file for debugging"
  (when (= 0 *log-level*)
    (with-temp-buffer
      (let ((today-str (format-time-string "%04Y-%02m-%02d" (current-time))))
	(unless (string= today-str *last-FLD*)
	  (setf *last-FLD* today-str)
	  (insert today-str) (newline))
	(dolist (msg (reverse *file-acc-buffer*))
	  (insert msg) (newline)))
      (append-to-file (point-min) (point-max) (concat *emacs-d* "elisp.log")))
    (setf *file-acc-buffer* nil)))
#+END_SRC
Since we have [[https://www.emacswiki.org/emacs/EmacsLispLimitations][no multi-threading in elisp]], we do not need to introduce any lock functions.
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun file-acc-push(msg)
  (push msg *file-acc-buffer*)
  (when (< 30 (length *file-acc-buffer*)) (clog-flush)))
#+END_SRC
The main logging function:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun clog (level fstr &rest args)
  "simple logging function" ; level is one of → :debug :info :warning :error
  (when (<= *log-level* (or (pos level '(:debug :info :warning :error)) 0))
    (let ((log-msg
	   (cons
	    (concat "%s " (format-time-string "%H:%M:%S "
(apply 'encode-time (butlast (decode-time (current-time)) 3)))
		    fstr)
	    (cons (symbol-name level) args))))
      (file-acc-push (apply #'format log-msg))
      (apply #'message log-msg)) nil))
#+END_SRC
where I inserted =nil= at the end just for convenience, since I often use
=clog= for error messages:
#+BEGIN_SRC emacs-lisp
(if (we-got-problems)
(clog :error "we've got %d problems!" 1000)
(the-rest-of-code))
#+END_SRC
← in case of "problems" I want this code block to return =nil=.

Let us not forget to flush the log
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(defun on-emacs-exit()
  (clog :debug "flushing comments before quiting emacs")
  (clog-flush))
#+END_SRC
before quitting emacs:
#+BEGIN_SRC emacs-lisp :tangle generated/logging.el
(add-hook 'kill-emacs-hook 'on-emacs-exit)
#+END_SRC
